package com.haozhuo.datag.com.service.Insurance

import scala.collection.mutable.ArrayBuffer
import scala.util.matching.Regex

object MatchGan {

  def nonum(yourString:String):String = {
    val regex = new Regex(
      """
        |.*CIN.{0,3}III.*|.*CIN.{0,3}三.*|.*CIN.{0,3}3.*|
        |.*(?<!无.{0,10}|不.{0,10}|未.{0,10})(恶变).*|
        |.*肝硬化.*|.*肝功能衰竭.*|.*肝脏增大.*|
        |.*自身免疫性肝炎.*|.*丙肝.*|.*丁肝.*|.*冠心病.*|
        |.*心肌梗.*|.*再生.{0,3}障碍性贫血.*|.*瘫痪.*|
        |.*恶性肿瘤.*|.*器官移植.*|.*精神.*病|.*免疫抑制剂.*|.*慢性.*乙肝.*|
        |.*第三心音.*|
        |.*移植.*|.*PCI.*|.*冠脉.*手术.*|.*冠脉介入.*|.*开胸手术.*|.*冠脉搭桥.*|
        |.*病理性(q|Q)波.*|.*心梗.*|.*急性心肌梗死.*|.*心肌梗死.*|
        |.*弓背.*向上抬高.*|
        |.*肾体积缩小.*|.*皮质部变薄.*|.*皮、髓质界限不清.*|.*肾与周围组织界限不清.*|.*实质弥漫性改变.*|.*肾椎体分界不清.*|
        |.*癌.*|
        |.*肝.*ca.*|.*肝.*硬化.*|.*肝.*结节.*|.*肝脏.*占位.*|.*小叶.*结构紊乱.*|.*肝包膜.{0,2}锯齿样改变.*|.*肝脏.*缩小.*|
        |.*胆汁性肝硬变.*|
        |.*肝脏形态大小正常，轮廓规整，肝左右叶可见一个不均匀的混合性回声区，约.*|
        |.*肝脏形态大小正常，轮廓规整，肝左右叶可见一个回声不均的混合性区.*边界清楚.*|
        |.*肝脏形态大小正常，轮廓规整，肝左右叶可见一个类圆形区/不规则区，约.*内部回声不均匀。边界较清楚，被一低回声带环绕.*|
        |.*肝包膜不光整，肝内回声增粗，分布不均，门静脉内径.*m.*|
        |.*肝脏体积缩小，形态失常，肝表面凹凸不平、呈锯齿状，肝缘变锐。其内回回声弥漫性增粗，分布不均匀。门静脉增宽，内径.*肝周间隙、肝肾隐窝见小片状无回声区，最深处约.*|
        |.*肝脏体积缩小，形态失常，肝表面凹凸不平、呈锯齿状，肝缘变锐。其内回回声弥漫性增粗，分布不均匀。门静脉增宽，内径.*。腹腔内见不规则无回声区，最深处约.*|
        |.*肝脏大小形态正常，实质回声不均匀，门脉主干及分枝结构紊乱，管壁不光滑，回声增强，管腔显示不清楚，门脉主干周围见多发迂曲扩张的条状无回声区，彩色多普勒显示其内未门脉血流信号.*|
        |.*肝脏普遍增大，肝缘钝，肝表面光滑，肝实质回声普遍减弱，肝内未见占位性病变。肝静脉和下腔静脉管径增宽，肝左、中、右静脉管径分别为.*下腔静脉生理性搏动减弱.*门静脉主干直径约.*肝内外胆管未见扩张.*|
        |.*门脉内径增宽，可见一低/等/强回声物充满官腔/附着于管壁.*|
        |.*门静脉内径增宽，内可见不规则团块状实质性回声，血流变细/消失.*|
        |.*肝脏形态大小正常（增大，形态失常），轮廓规整（不规整），肝左右叶可见一个不均匀高中低回声区，边界清楚（不清楚），形态规则（不规则）。大小约.*大小。周边见低回声晕，内部可见动脉血流信号.*|
        |.*肝脏形态大小正常，轮廓规整，部分肝实质呈云雾状，肝内胆管壁增强增厚，胆管内见沉积物.*|
        |.*肝部分切除术后，余肝脏形态大小正常，轮廓规整，实质回声均匀，肝内管道结构清晰。门静脉不宽.*|
        |.*肝脏各径线增大.*|
        |.*肝脏各径线缩小.*|
        |.*肝脏形态大小正常，轮廓规整，肝左右叶见.*大小的低回声区，边界清楚，形态欠规则，周围无声晕，内部回声不均匀，其内可见散在略强的斑点状回声。余肝实质回声均匀。门脉及肝内外胆管不扩张。CDFI：低回声区内部及周围见较丰富血流信号|
        |.*脏形态大小正常，包膜光整，肝左右叶可见低/高/等回声区.*形态规则，后方回声无衰减.*|
        |.*腹腔内可见移动的无回声区，最深处约.*|
        |.*腹膜后可见一个/多个低回声区，大小/大者.*|
        |.*腹膜后可见形态不规则的回声区，大小.*不随体位改变及呼吸上下移动.*|
        |.*腹腔内形态不规则的回声区，大小.*不随体位改变及呼吸上下移动.*|
        |.*食道下端可见可见扭曲的无回声结构，彩色多普勒显示彩色血流信号.*|
        |.*肝脏形态大小正常，包膜光整，肝[部位]叶可见一类圆形强回声区，大小约为.*其内回声呈网络样，后方回声无衰减.*|
        |.*肝脏形态大小正常，包膜光整，肝内可见[部位]回声，大小约.*,形态规则，后方回声无衰减.*|
        |.*肝脏大小形态正常，于肝内可探及大小约.*的低回声区，边界尚清，CDFI：未见明显异常血流信号，余肝实质未见明显异常回声，肝内血管走形清晰，门脉主干内径及肝内外胆管未见扩张.*|
        |.*门静脉内径宽约.*|
        |.*腹腔积液.*|
        |.*肝脏轮廓规整，大小正常，包膜光滑，上界：右锁中线.*下界：右锁中线肋弓下.*内光点分布尚可，血管走向清晰.*|
        |.*肝静脉增宽.*|
        |.*侧胸腔积液.*|
        |.*肝内可见实性结节，大小约.*，边界清，形态规则，未见包膜。CDFI可见少许血流信号.*|
        |.*肝.*叶.*可探及一大小约.*回声.*|
        |.*肝脏*叶上方胸壁处查见范围。*回声区，边界清，形态规则，内透声差，内可见细密点状回声，内可见斑片状强回声，未见血流信号.*|
        |.*T波.{0,10}倒置.*|.*T波.*异常高大.*|.*T波.*不对称.*|.*不对称.*T波.*|
        |.*肿瘤.{0,10}手术.*|.*手术.{0,10}肿瘤.*|
        |.*肿瘤.*阳性.*|.*阳性.*肿瘤.*|.*肿瘤.{0,10}+.*|
        |.*病理性.{0,2}波.*|

      """
    )
    var result_status = "1"
    var result_vue = "可以推送"

    val diedai = regex.findAllIn(yourString)
    while (diedai.hasNext) {

      val dataRow: String = diedai.next()

      //匹配判断每一行
      result_status = "0"
      result_vue = dataRow



    }
    if (result_status.eq("1")) "1" else result_status + "_" + result_vue
  }
    def num(yourString: String): String = {
      val regex = new Regex(
        """
          |.*HBV.*DNA.*|
          |.*胃.*|.*食管.*静脉曲张.*|
          |.*抗病毒药物.*|
          |.*门脉高压.*|.*肝内点状回声.*|

        """
      )
      var result_status = "1"
      var result_vue = "可以推送"

      val diedai = regex.findAllIn(yourString)
      //匹配判断每一行
      while (diedai.hasNext) {

        val dataRow: String = diedai.next()



        //匹配HBV≤105IU/ml
        if (dataRow.contains("HBV")) {
          val max: String = getCm(dataRow)
          //判断
          result_status = if (max.toDouble > 105) "0" else result_status
          //        println(string_next)
          result_vue = if (max.toDouble > 105) dataRow else result_vue
        }

        //胃 占位|ca|静脉曲张
        if(dataRow.contains("占位")|dataRow.contains("ca")|dataRow.contains("静脉曲张")){
          result_status="0"
          result_vue=dataRow
        }
        //使用抗病毒药物大于6个月
        if(dataRow.contains("抗病毒药物")){
          val max: String = getCm(dataRow)
          //判断
          result_status = if (max.toDouble >= 6) "0" else result_status
          //        println(string_next)
          result_vue = if (max.toDouble >= 6) dataRow else result_vue
        }
        //门脉高压 门静脉增粗|脾大|腹水|
        if(dataRow.contains("门脉高压")&
          (dataRow.contains("门静脉增粗")|dataRow.contains("脾大")|dataRow.contains("腹水")) ){
            result_status="0"
            result_vue=dataRow
        }
        //肝内点状回声 增多|变粗
        if(dataRow.contains("肝内点状回声")&(dataRow.contains("增多")|dataRow.contains("变粗")|dataRow.contains("增粗"))){
          result_status="0"
          result_vue=dataRow
        }
      }


      if (result_status.eq("1")) "1" else result_status + "_" + result_vue

    }

    def getCm(str: String) = {
      val regex_num = new Regex(
        """
          |[0-9]+\.[0-9]+|
          |[0-9]+|
        """
      )

      //定义返回值
      var max = " "

      //转换为cm,获取最大值
      if (str.contains("mm") | str.contains("MM") | str.contains("M M") | str.contains("m m")) {


        //创建数组获取最大值
        val row_ints = new ArrayBuffer[Double]

        val result_1 = regex_num.findAllIn(str)
        while (result_1.hasNext) {
          //获取最大值
          row_ints.append(result_1.next().toDouble / 10.0)
        }
        max = row_ints.max.toString
      }

      //不转换，获取最大值
      else if (str.contains("cm") | str.contains("CM") | str.contains("c m") | str.contains("C M")) {
        //创建数组获取最大值
        val row_ints = new ArrayBuffer[Double]

        val result_1 = regex_num.findAllIn(str)
        while (result_1.hasNext) {
          //获取最大值
          row_ints.append(result_1.next().toDouble)
        }
        max = row_ints.max.toString
      }
      else {
        val row_ints = new ArrayBuffer[Double]
        val result_1 = regex_num.findAllIn(str)
        while (result_1.hasNext) {
          //获取最大值
          row_ints.append(result_1.next().toDouble)
        }
        //没有匹配到数字，应该还是成功的
        if (row_ints.isEmpty) {
          println("正则匹配到数据，但是没有匹配到数值")
          max = "-1"
          println(str)
        } else {
          max = row_ints.max.toString
        }

      }


      max

    }


    def main(args: Array[String]): Unit = {
      println(nonum("阴性\n恶变+\n双侧乳腺腺体层增厚,内部结构紊乱,回声不均，未见异常血流。\n未见异常\n未见异常\n无\n内科未发现明显异常\n整齐\n80--90次/分\n未见异常\n未见异常\n未见异常\n未见异常\n无\n未见异常\n未见异常\n未见异常\n未见异常\n未见异常\n未见异常\n未见异常\n未见异常\n未见异常\n未见异常\n未见异常\n无\n输尿管上段、膀胱壁间段无扩张。\n右肾大小、形态正常，包膜光滑，肾实质回声均匀，集合系统未见明显分离。\n左肾、右肾、膀胱、双侧输尿管未发现明显异常\n左肾大小、形态正常，包膜光滑，肾实质回声均匀，集合系统未见明显分离。\n膀胱充盈良好，壁光滑，延续性好，其内透声性良好，未见明显占位性病变。\n双侧乳腺小叶增生\n无\n未见异常，活动自如\n疤痕部位:右下腹疤痕：阑尾炎术后\n乳房:双侧乳腺小叶增生\n阑尾切除术后\n无\n未见异常\n无\n未见异常\n未查\n右下腹疤痕：阑尾炎术后\n无\n无\n无\n未见异常\n无\n未查\n未见异常，活动自如\n无\n右附件区未见明显异常回声。\n子宫形态大小正常，轮廓光整，子宫后壁可见一个低回声区，大小约25mm×20mm，边界清，内部回声均匀．\n子宫:子宫肌瘤\n左附件、右附件未发现明显异常\n左附件区未见明显异常回声。\n阴性\n1.010\n未见\n未见\n阴性\n阴性\n阴性\n阴性\n阴性\n阴性\n阴性\n6.5\n未见\n未见\n阴性\n阴性\n裸眼视力右:0.4\n裸眼视力左:0.5\n0.4\n0.5\n甲状腺彩超未发现明显异常\n双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。\n1.92\n0.76\n眼压检查未见异常\n正常\n眼底检查未发现明显异常\n眼科外眼检查未发现明显异常\n正常\n正常\n正常\n正常\n5.24\n3.53\n正常\n正常\n耳鼻喉检查未见异常\n正常\n正常\n正常\n正常\n正常\n正常\n无\n正常\n18\n18\n17.4\n45.8\n3.6\n肝、胆、胰、脾未发现明显异常\n肝脏大小、形态正常，包膜光整，肝内血管走行较清晰，光点分布尚均匀，其内未见明显异常光团。\n胆囊大小、形态正常，囊壁光整，囊腔内透声好，胆总管无扩张。\n胰腺大小、形态正常，边缘规整，内部回声均匀，胰管未见扩张。\n脾脏大小、形态正常，包膜光整，内光点均匀。\n380 ↑\n6.75\n88\n血压:124/75mmHg\n124\n75\n68.5\n5.98\n6.5\n0.57\n0.4\n0.04\n1.8\n0.16\n92\n10.1\n30.2\n328\n22.8\n2\n8.75\n11.1\n40.2\n42.3\n4.6\n0.238\n235\n139\n20\n4.82\n6.05\n3.75 ↑\n1.09\n1.47\n裂隙灯检查未发现明显异常\n正常\n正常\n正常\n正常\n窦性心律\n短P-R间期综合征\n辨色力未发现明显异常\n正常"))
      println(num("""阴性
        双侧乳腺小叶增生
        双侧乳腺腺体层增厚,内部结构紊乱,回声不均，未见异常血流。
      未见异常
      未见异常
      内科未发现明显异常
      整齐
      80--90次/分
        未见异常
      未见异常
      未见异常
      未见异常
      无
      未见异常
      未见异常
      未见异常
      未见异常
      未见异常
      未见异常
      未见异常
      未见异常
      未见异常
      未见异常
      未见异常
      无
      输尿管上段、膀胱壁间段无扩张。
      右肾大小、形态正常，包膜光滑，肾实质回声均匀，集合系统未见明显分离。
      左肾、右肾、膀胱、双侧输尿管未发现明显异常
      左肾大小、形态正常，包膜光滑，肾实质回声均匀，集合系统未见明显分离。
      膀胱充盈良好，壁光滑，延续性好，其内透声性良好，未见明显占位性病变。
      双侧乳腺小叶增生
      无
      未见异常，活动自如
      疤痕部位:右下腹疤痕：阑尾炎术后
      乳房:双侧乳腺小叶增生
      阑尾切除术后
      无
      未见异常
      无
      未见异常
      未查
      右下腹疤痕：阑尾炎术后
      无
      无
      无
      未见异常
      无
      未查
      未见异常，活动自如
      无
      右附件区未见明显异常回声。
      子宫形态大小正常，轮廓光整，子宫后壁可见一个低回声区，大小约25mm×20mm，边界清，内部回声均匀．
      子宫:子宫肌瘤
      左附件、右附件未发现明显异常
      左附件区未见明显异常回声。
      阴性
      1.010
      未见
      未见
      阴性
      阴性
      阴性
      阴性
      阴性
      阴性
      阴性
      6.5
      未见
      未见
      阴性
      阴性
      裸眼视力右:0.4
      裸眼视力左:0.5
      0.4
      0.5
      甲状腺彩超未发现明显异常
      双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。
      1.92
      0.76
      眼压检查未见异常
      正常
      眼底检查未发现明显异常
      眼科外眼检查未发现明显异常
      正常
      正常
      正常
      正常
      5.24
      3.53
      正常
      正常
      耳鼻喉检查未见异常
      正常
      正常
      正常
      正常
      正常
      正常
      无
      正常
      18
      18
      17.4
      45.8
      3.6
      肝、胆、胰、脾未发现明显异常
      肝脏大小、形态正常，包膜光整，肝内血管走行较清晰，光点分布尚均匀，其内未见明显异常光团。
      胆囊大小、形态正常，囊壁光整，囊腔内透声好，胆总管无扩张。
      胰腺大小、形态正常，边缘规整，内部回声均匀，胰管未见扩张。
      脾脏大小、形态正常，包膜光整，内光点均匀。
      380 ↑
        6.75
      88
      血压:124/75mmHg
        124
      75
      68.5
      5.98
      6.5
      0.57
      0.4
      0.04
      1.8
      0.16
      92
      10.1
      30.2
      328
      22.8
      2
      8.75
      11.1
      40.2
      42.3
      4.6
      0.238
      235
      139
      20
      4.82
      6.05
      3.75 ↑
        1.09
      1.47
      裂隙灯检查未发现明显异常
      正常
      恶变
      正常
      正常
      窦性心律
      短P-R间期综合征
      辨色力未发现明显异常
      正常"""))
    }


}
